var dimention="3d";
function initPoints() {
    points = [];
}
function initDescr() {
      var conditions = "Пример 7.2. Приведём квадратичную форму $$f\\left( {{x}_{1}},{{x}_{2}},{{x}_{3}} \\right)=x_{1}^{2}+8x_{2}^{2}+8x_{3}^{2}+4{{x}_{1}}{{x}_{2}}+6{{x}_{1}}{{x}_{3}}+16{{x}_{2}}{{x}_{3}}$$ к каноническому виду методом Лагранжа.";
      $("#conditions").html(conditions);
      var algorithm = "Решение. Так как ${{a}_{11}}=1\\ne 0$, выделим все слагаемые с переменной ${{x}_{1}}$ и достроим их сумму до полного квадрата. $\\begin{matrix} f\\left( {{x}_{1}},{{x}_{2}},{{x}_{3}} \\right)=\\left( x_{1}^{2}+4{{x}_{1}}{{x}_{2}}+6{{x}_{1}}{{x}_{3}} \\right)+8x_{2}^{2}+8x_{3}^{2}+16{{x}_{2}}{{x}_{3}}= \\\\ =\\left( x_{1}^{2}+2{{x}_{1}}\\left( 2{{x}_{2}}+3{{x}_{3}} \\right)+{{\\left( 2{{x}_{2}}+3{{x}_{3}} \\right)}^{2}} \\right)-{{\\left( 2{{x}_{2}}+3{{x}_{3}} \\right)}^{2}}+8x_{2}^{2}+8x_{3}^{2}+16{{x}_{2}}{{x}_{3}}= \\\\ ={{\\left( {{x}_{1}}+2{{x}_{2}}+3{{x}_{3}} \\right)}^{2}}+4x_{2}^{2}+4{{x}_{2}}{{x}_{3}}-x_{3}^{2}={{\\left( {{x}_{1}}+2{{x}_{2}}+3{{x}_{3}} \\right)}^{2}}+{{f}^{*}}\\left( {{x}_{2}},{{x}_{3}} \\right) \\\\ \\end{matrix}$ <br>Далее выделим полный квадрат с переменной ${{x}_{2}}$: $\\begin{align*} & {{f}^{*}}\\left( {{x}_{2}},{{x}_{3}} \\right)=4x_{2}^{2}+4{{x}_{2}}{{x}_{3}}-x_{3}^{2}={{\\left( 2{{x}_{2}} \\right)}^{2}}+2\\cdot 2{{x}_{2}}{{x}_{3}}+x_{3}^{2}-2x_{3}^{2}= \\\\ & ={{\\left( 2{{x}_{2}}+{{x}_{3}} \\right)}^{2}}-2x_{3}^{2}. \\\\ \\end{align*}$ <br>Пусть теперь $$\\left\\{ \\begin{align*} & {{{{x}'}}_{1}}={{x}_{1}}+2{{x}_{2}}+3{{x}_{3}} \\\\ & {{{{x}'}}_{2}}=2{{x}_{2}}+{{x}_{3}} \\\\ & {{{{x}'}}_{3}}={{x}_{3}} \\\\ \\end{align*} \\right.$$ Получили $$f\\left( x'_1,x'_2,x'_3 \\right) ={{x}'_1}^2+{{x}'_2}^2-2{{x}'_3}^{2}.$$ Канонический вид квадратичной формы получен. <br>Выразим старые переменные через новые: $\\left\\{ \\begin{align*} & {{x}_{1}}={{{{x}'}}_{1}}-{{{{x}'}}_{2}}-2{{{{x}'}}_{3}} \\\\ & {{x}_{2}}=\\frac{1}{2}{{{{x}'}}_{2}}-\\frac{1}{2}{{{{x}'}}_{3}} \\\\ & {{x}_{3}}={{{{x}'}}_{3}} \\\\ \\end{align*} \\right.$ <br>Составим матрицу перехода к каноническому базису, зная, что $X=U{X}'$. Получим $$U=\\left( \\begin{matrix} 1 & -1 & -2 \\\\ 0 & \\frac{1}{2} & -\\frac{1}{2} \\\\ 0 & 0 & 1 \\\\ \\end{matrix} \\right)$$ <br>Если исходный базис содержит векторы ${{\\bar{e}}_{1}},{{\\bar{e}}_{2}},{{\\bar{e}}_{3}}$, то матрица $U$ однозначно определяет новый канонический базис $\\left\\{ {{{{\\bar{e}}'}}_{1}},{{{{\\bar{e}}'}}_{2}},{{{{\\bar{e}}'}}_{3}} \\right\\}$, так как элементы её столбцов есть координаты соответствующих новых базисных векторов. $\\left\\{ \\begin{align*} & {{{{\\bar{e}}'}}_{1}}={{{\\bar{e}}}_{1}} \\\\ & {{{{\\bar{e}}'}}_{2}}=-{{{\\bar{e}}}_{1}}+\\frac{1}{2}{{{\\bar{e}}}_{2}} \\\\ & {{{{\\bar{e}}'}}_{3}}=-2{{{\\bar{e}}}_{1}}-\\frac{1}{2}{{{\\bar{e}}}_{2}}+{{{\\bar{e}}}_{3}} \\\\ \\end{align*} \\right.$ &mdash; канонический базис. ";
    $("#algorithm").html(algorithm);
    $("#containerYellow").css({"min-width": "520px"});
    $("Title").html("Пример 7.2");
    MathJax.Hub.Queue(["Typeset",MathJax.Hub]);
}
function initData() {
    isShowAxes = false;

    if (arrPoint != 0) {
        primitives.push({class:"point", text: "", arr0:arrPoint, rad:chosenPointRad, color:[1.0, 0.0, 1.0, 1.0]}); 
    }
}